app/controllers/articles_controller.rb

  def edit
    @article = current_user.articles.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? AND "articles"."id" = ?  ORDER BY published_at DESC, title ASC LIMIT 1  [["user_id", 914507133], ["id", 517600287]]

  def create
    @article = current_user.articles.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("title", "body", "published_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Hello Racine"], ["body", "hey "], ["published_at", "2015-10-02 01:11:00.000000"], ["created_at", "2015-10-02 01:11:41.204469"], ["updated_at", "2015-10-02 01:11:41.204469"]]

  def update
    @article = current_user.articles.find(params[:id])
    respond_to do |format|
      if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? AND "articles"."id" = ?  ORDER BY published_at DESC, title ASC LIMIT 1  [["user_id", 914507133], ["id", 517600287]]
UPDATE "articles" SET "title" = ?, "location" = ?, "excerpt" = ?, "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "asdfasd"], ["location", "asdfASD"], ["excerpt", "asdfASasd"], ["body", "asdfASDasd"], ["updated_at", "2015-10-02 01:34:42.963111"], ["id", 4]]

  def destroy
	@article = current_user.articles.find(params[:id])
    @article.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."user_id" = ? AND "articles"."id" = ?  ORDER BY published_at DESC, title ASC LIMIT 1  [["user_id", 5], ["id", 14]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 14]]

  def notify_friend
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 7]]