app/controllers/comments_controller.rb

INSERT INTO "comments" ("name", "email", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Bob"], ["email", "shhh@mmm.ddd"], ["body", "hjkjsdhkjhkjdkjhksjhjk"], ["article_id", 14], ["created_at", "2015-11-03 01:20:49.398614"], ["updated_at", "2015-11-03 01:20:49.398614"]]
---
  def create
    @comment = @article.comments.new(comment_params)
    if @comment.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 15]]
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT 1  [["article_id", 15], ["id", 3]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]
---
  def destroy
    @article = current_user.articles.find(params[:article_id])
    @comment = @article.comments.find(params[:id])
    @comment.destroy

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 14]]
---
  def load_article
    @article = Article.find(params[:article_id])