app/controllers/users_controller.rb

	def create
	  @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("email", "hashed_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "john@smith.net"], ["hashed_password", "8cb2237d0679ca88db6464eac60da96345513964"], ["created_at", "2015-10-29 22:28:47.314447"], ["updated_at", "2015-10-29 22:28:47.314447"]]